//===================================================
//
// 鳥の状態 [BirdState.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "BirdState.h"
#include"bird.h"
#include"motion.h"
#include"game.h"

//===================================================
// コンストラクタ
//===================================================
CBirdState::CBirdState()
{
	m_ID = ID_BASE;
	m_pBird = nullptr;
}

//===================================================
// コンストラクタ(オーバーロード)
//===================================================
CBirdState::CBirdState(ID Id)
{
	m_ID = Id;
	m_pBird = nullptr;
}

//===================================================
// デストラクタ
//===================================================
CBirdState::~CBirdState()
{
}

//===================================================
// コンストラクタ
//===================================================
CBirdIdle::CBirdIdle()
{
}

//===================================================
// デストラクタ
//===================================================
CBirdIdle::~CBirdIdle()
{
}

//===================================================
// 初期化処理
//===================================================
void CBirdIdle::Init(void)
{
	// 鳥の取得
	CBird* pBird = CBirdState::GetBird();

	// 取得できなかったら処理しない
	if (pBird == nullptr) return;

	// モーションの取得
	CMotion* pMotion = pBird->GetMotion();

	// 取得できなかったら処理しない
	if (pMotion == nullptr) return;

	// ランダムな値の選出
	int nRandom = rand() % 2;

	// モーションの種類の設定
	int motionType = (nRandom == 0) ? CBird::MOTIONTYPE_NEUTRAL000 : CBird::MOTIONTYPE_NEUTRAL001;

	// モーションの設定
	pMotion->SetMotion(motionType, true, 10);
}

//===================================================
// 更新処理
//===================================================
void CBirdIdle::Update(void)
{

}
