//===================================================
//
// 鳥のマネージャー [BirdManager.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "BirdManager.h"
#include"bird.h"

//***************************************************
// 静的メンバ変数宣言
//***************************************************
CBirdManager* CBirdManager::m_pInstance = nullptr; // 自分のインスタンス

//===================================================
// 対象の位置からの距離を判定
//===================================================
bool CBirdManager::CheckDistance(const D3DXVECTOR3 otherPos, const float fRadius)
{
	// 判定結果
	bool bResult = false;

	// 要素を調べる
	for (auto itr = m_apBirdList.begin(); itr != m_apBirdList.end(); ++itr)
	{
		// nullだったら処理を飛ばす
		if ((*itr) == nullptr) continue;

		// 一定の範囲近づいたか判定
		if ((*itr)->CheckDistance(otherPos, fRadius))
		{
			bResult = true;
		}
	}

	return bResult;
}

//===================================================
// コンストラクタ
//===================================================
CBirdManager::CBirdManager()
{
}

//===================================================
// デストラクタ
//===================================================
CBirdManager::~CBirdManager()
{
}

//===================================================
// 生成処理
//===================================================
void CBirdManager::Create(void)
{
	// 自分が生成されていなかったら
	if (m_pInstance == nullptr)
	{
		// 鳥のマネージャー生成
		m_pInstance = new CBirdManager;
	}
}

//===================================================
// インスタンスを指定してリストから切り離す
//===================================================
void CBirdManager::Erase(CBird* pBird)
{
	// 要素を調べる
	for (auto itr = m_apBirdList.begin(); itr != m_apBirdList.end(); ++itr)
	{
		// nullだったら処理しない
		if ((*itr) == nullptr) continue;

		if ((*itr) == pBird)
		{
			(*itr)->Uninit();
			(*itr) = nullptr;
			itr = m_apBirdList.erase(itr);
			break;
		}
	}
}

//===================================================
// 初期化処理
//===================================================
HRESULT CBirdManager::Init(void)
{
	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CBirdManager::Uninit(void)
{
	// 終了処理
	CObject::Release();
}

//===================================================
// 更新処理
//===================================================
void CBirdManager::Update(void)
{

}

//===================================================
// 描画処理
//===================================================
void CBirdManager::Draw(void)
{
}
