//===================================================
//
// ブロック [block.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "block.h"
#include<string>

//===================================================
// コンストラクタ
//===================================================
CBlock::CBlock()
{
}

//===================================================
// デストラクタ
//===================================================
CBlock::~CBlock()
{
}

//===================================================
// 生成処理
//===================================================
CBlock* CBlock::Create(const D3DXVECTOR3 pos, const char* pModelFileName, const D3DXVECTOR3 rot)
{
	CBlock* pBlock = new CBlock;

	// 初期化処理
	if (FAILED(pBlock->Init()))
	{// 初期化に失敗したら

		// 終了処理
		pBlock->Uninit();
		pBlock = nullptr;
		return nullptr;
	}

	// 位置の設定
	pBlock->SetPosition(pos);

	// 向きの設定
	pBlock->GetRotaition()->Set(rot);

	// 省略用パス
	std::string pPath = "data/MODEL/";
	
	// 文字列をつなげる
	pPath += pModelFileName;

	// モデルのロード
	pBlock->LoadModel(pPath.c_str());

	return pBlock;
}

//===================================================
// 初期化処理
//===================================================
HRESULT CBlock::Init(void)
{
	// 初期化処理
	if (FAILED(CObjectX::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CBlock::Uninit(void)
{
	// 終了処理
	CObjectX::Uninit();
}

//===================================================
// 更新処理
//===================================================
void CBlock::Update(void)
{

}

//===================================================
// 描画処理
//===================================================
void CBlock::Draw(void)
{
	// 描画処理
	CObjectX::Draw();
}
