//===================================================
//
// 編集 [edit.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "edit.h"
#include "meshfield.h"
#include "game.h"
#include"GameCamera.h"

using namespace Const; // 名前空間Constを使用

//===================================================
// コンストラクタ
//===================================================
CEdit::CEdit() : CScene(MODE_EDIT)
{
	m_pCamera = nullptr;
}

//===================================================
// デストラクタ
//===================================================
CEdit::~CEdit()
{
}

//===================================================
// 初期化処理
//===================================================
HRESULT CEdit::Init(void)
{
	// カメラの生成
	m_pCamera = new CGameCamera;
	m_pCamera->Init();

	// フィールドの生成
	CMeshField::Create(VEC3_NULL, 32, 32, D3DXVECTOR2(1500.0f, 1500.0f));

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CEdit::Uninit(void)
{
	// カメラの破棄
	if (m_pCamera != nullptr)
	{
		m_pCamera->Uninit();
		delete m_pCamera;
		m_pCamera = nullptr;
	}
}

//===================================================
// 更新処理
//===================================================
void CEdit::Update(void)
{
	// カメラの更新
	if (m_pCamera != nullptr)
	{
		m_pCamera->Update();
	}
}

//===================================================
// 描画処理
//===================================================
void CEdit::Draw(void)
{
	// カメラの描画
	if (m_pCamera != nullptr)
	{
		m_pCamera->SetCamera();
	}
}
