//===================================================
//
// フェード処理 [fade.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _FADE_H_
#define _FADE_H_

//***************************************************
// インクルードファイル
//***************************************************
#include"main.h"

//***************************************************
// フェードクラスの定義
//***************************************************
class CFade
{
public:
	~CFade();

	static CFade* Create(void);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	CFade();
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuffer; // 頂点バッファへのポインタ
};

#endif
