//==============================================
//
// 歯車 [gear.cpp]
// Author:YUTO YOSHIDA
//
//==============================================

//**********************************************
// インクルードファイル
//**********************************************
#include "gear.h"

//==============================================
// コンストラクタ
//==============================================
CGear::CGear()
{
	m_fRotValue = NULL;
}

//==============================================
// デストラクタ
//==============================================
CGear::~CGear()
{
}

//==============================================
// 生成処理
//==============================================
CGear* CGear::Create(const D3DXVECTOR3 pos)
{
	CGear* pGear = new CGear;

	// 位置の設定処理
	pGear->SetPosition(pos);

	// 初期化処理
	if (FAILED(pGear->Init()))
	{
		pGear->Uninit();
		pGear = nullptr;
		return nullptr;
	}

	return pGear;
}

//==============================================
// 初期化処理
//==============================================
HRESULT CGear::Init(void)
{
	// 初期化処理
	if (FAILED(CObjectX::Init()))
	{
		return E_FAIL;
	}

	// モデルのロード
	CObjectX::LoadModel("data/MODEL/obj/gear000.x");
	
	// 角度の設定
	CObjectX::SetRotation(D3DXVECTOR3(0.0f, D3DX_PI * 0.5f, 0.0f));

	m_fRotValue = 0.001f;
	return S_OK;
}

//==============================================
// 終了処理
//==============================================
void CGear::Uninit(void)
{
	// 終了処理
	CObjectX::Uninit();
}

//==============================================
// 更新処理
//==============================================
void CGear::Update(void)
{
	// 向きの取得
	D3DXVECTOR3 rot = CObjectX::GetRotation();

	// 回転させる
	rot.z += m_fRotValue;

	// 向きの設定
	CObjectX::SetRotation(rot);
}

//==============================================
// 描画処理
//==============================================
void CGear::Draw(void)
{
	// 描画処理
	CObjectX::Draw();
}
