//===================================================
//
// メイン [main.h]
// Author:YOSHIDA YUUTO
//
//===================================================

//***************************************************
// 二重インクルード防止
//***************************************************
#ifndef _MAIN_H_
#define _MAIN_H_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// メインクラスの定義
//***************************************************
class CMain
{
public:
	~CMain();
	static void Create(void);
	static CMain* GetInstance(void) { return m_pInstance; }
	void Uninit(void);
	void ToggleFullscreen(HWND hWnd); // フルスクリーン
private:
	CMain();
	static 	CMain* m_pInstance;		  // 自分のインスタンス
	bool m_bFullScreen;				  // フルスクリーンかどうか
	RECT m_windowRect;				  // ウィンドウのサイズ
};
#endif
