//===================================================
//
// オブザーバー [Observer.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _OBSERVER_H_
#define _OBSERVER_H_

//***************************************************
// インクルードファイル
//***************************************************
#include"main.h"

//***************************************************
// 前方宣言
//***************************************************
class CHpGage;

//***************************************************
// オブザーバークラスの定義
//***************************************************
class CObserver
{
public:
	CObserver();
	virtual ~CObserver();
	virtual void OnNotify(const int nValue) = 0; // 値の変化を通知
private:
};

//***************************************************
// HPオブザーバークラスの定義
//***************************************************
class CHpObserver : public CObserver
{
public:
	CHpObserver(CHpGage *pHpGage);
	~CHpObserver();
	void OnNotify(const int nValue) override;
private:
	CHpGage* m_pHpGage;
};
#endif