//==============================================
//
// 障害物マネージャー [obstaclemanager.cpp]
// Author:YUTO YOSHIDA
//
//==============================================

//**********************************************
// インクルードファイル
//**********************************************
#include "obstaclemanager.h"

using namespace std; // 名前空間stdを使用

//**********************************************
// 静的メンバ変数宣言
//**********************************************
vector<CObstacle*> CObstacleManager::m_apObstacle = {};

//==============================================
// コンストラクタ
//==============================================
CObstacleManager::CObstacleManager()
{

}

//==============================================
// デストラクタ
//==============================================
CObstacleManager::~CObstacleManager()
{
}

//==============================================
// 障害物の設定
//==============================================
void CObstacleManager::AddObstacle(CObstacle* pObstacle)
{
	// 障害物の設定
	m_apObstacle.push_back(pObstacle);
}