//===================================================
//
// ランキングシーン [ranking.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _RANKING_H_
#define _RANKING_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "scene.h"
#include <memory>

//***************************************************
// 前方宣言
//***************************************************
class CResultCamera;

//***************************************************
// ランキングシーンの定義
//***************************************************
class CRanking : public CScene
{
public:
	CRanking();
	~CRanking();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;
private:
	std::unique_ptr<CResultCamera> m_pCamera; // リザルトのカメラ
};

#endif
