//===================================================
//
// リザルトカメラ [ResultCamera.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "ResultCamera.h"

using namespace Const; // 名前空間Constを使用

//===================================================
// コンストラクタ
//===================================================
CResultCamera::CResultCamera()
{
}

//===================================================
// デストラクタ
//===================================================
CResultCamera::~CResultCamera()
{
}

//===================================================
// 初期化処理
//===================================================
HRESULT CResultCamera::Init(void)
{
	// 初期化処理
	CCamera::Init();

	// カメラの設定
	CCamera::SetCamera(D3DXVECTOR3(0.0f, 500.0f, 500.0f), VEC3_NULL, D3DXVECTOR3(-D3DX_PI * 0.65f, 0.0f, 0.0f));

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CResultCamera::Uninit(void)
{
	// 終了処理
	CCamera::Uninit();
}

//===================================================
// 更新処理
//===================================================
void CResultCamera::Update(void)
{
	// カメラの向きの取得
	D3DXVECTOR3 rot = CCamera::GetRotaition();

	// カメラを回転
	rot.y += 0.005f;

	// 向きの設定
	CCamera::SetRot(rot);

	// 更新処理
	CCamera::Update();

	// 視点の更新
	CCamera::UpdatePositionV();

	// 注視点の更新
	CCamera::UpdatePositionR();
}
