//===================================================
//
// リザルトシーン [result.h]
// Author:YUTO YOSHIDA
//
//===================================================

//*************************************************
// 多重インクルード防止
//*************************************************
#ifndef _RESULT_H_
#define _RESULT_H_

//***************************************************
// インクルードファイル
//***************************************************
#include"main.h"
#include "scene.h"

//***************************************************
// ゲームクラスの定義
//***************************************************
class CResult : public CScene
{
public:

	CResult();
	~CResult();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
};

#endif