//===================================================
//
// リザルトシーン [result.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//*************************************************
// インクルードファイル
//*************************************************
#include "result.h"
#include"meshfield.h"
#include"manager.h"
#include"title.h"
#include"input.h"
#include"fade.h"

using namespace Const; // 名前空間Constを使用
using namespace std; // 名前空間stdを使用

//===================================================
// コンストラクタ
//===================================================
CResult::CResult() : CScene(MODE_RESULT)
{
}

//===================================================
// デストラクタ
//===================================================
CResult::~CResult()
{
}

//===================================================
// 初期化処理
//===================================================
HRESULT CResult::Init(void)
{
	// フィールドの設定
	CMeshField::Create(VEC3_NULL, 48, 48, D3DXVECTOR2(5500.0f, 5500.0f));

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CResult::Uninit(void)
{
}

//===================================================
// 更新処理
//===================================================
void CResult::Update(void)
{
	// キーボードの取得
	CInputKeyboard* pKeyboard = CManager::GetInputKeyboard();

	if (pKeyboard->GetTrigger(DIK_F9))
	{
		CFade* pFade = CManager::GetFade();

		// 新しいモードの設定
		pFade->SetFade(make_unique<CTitle>());
	}
}

//===================================================
// 描画処理
//===================================================
void CResult::Draw(void)
{
}
