//===================================================
//
// タイトルのプレイヤー [TitlePlayer.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "TitlePlayer.h"

//===================================================
// コンストラクタ
//===================================================
CTitlePlayer::CTitlePlayer()
{
}

//===================================================
// デストラクタ
//===================================================
CTitlePlayer::~CTitlePlayer()
{
}

//===================================================
// 生成処理
//===================================================
CTitlePlayer* CTitlePlayer::Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 rot)
{
	// プレイヤーの生成
	auto pPlayer = new CTitlePlayer;

	// プレイヤーの初期化
	pPlayer->Init();

	// キャラクターの取得
	//auto pCharacter = pPlayer->GetCharacter();

	//pCharacter->SetPosition(pos);
	//pCharacter->GetRotation()->Set(rot);
	//pCharacter->GetRotation()->SetDest(rot);
	return pPlayer;
}

//===================================================
// 初期化処理
//===================================================
HRESULT CTitlePlayer::Init(void)
{
	// 初期化処理
	CCharacter3D::Init();

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CTitlePlayer::Uninit(void)
{
	// 終了処理
	CCharacter3D::Uninit();
}

//===================================================
// 更新処理
//===================================================
void CTitlePlayer::Update(void)
{
	// 更新処理
	CCharacter3D::Update();
}

//===================================================
// 描画処理
//===================================================
void CTitlePlayer::Draw(void)
{
	// 描画処理
	CCharacter3D::Draw();
}
