//===================================================
//
// タイトルシーン [title.h]
// Author:YUTO YOSHIDA
//
//===================================================

//*************************************************
// 多重インクルード防止
//*************************************************
#ifndef _TITLE_H_
#define _TITLE_H_

//***************************************************
// インクルードファイル
//***************************************************
#include"main.h"
#include "scene.h"

//***************************************************
// 前方宣言
//***************************************************
class CTitleCamera;

//***************************************************
// タイトルクラスの定義
//***************************************************
class CTitle : public CScene
{
public:
	CTitle();
	~CTitle();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CTitleCamera* GetCamera(void) { return m_pCamera; }
private:
	static CTitleCamera* m_pCamera; // タイトルカメラクラスへのポインタ
};

#endif

