//===================================================
//
// タイトルカメラ [TitleCamera.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _TITLECAMERA_H_
#define _TITLECAMERA_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "camera.h"

//***************************************************
// タイトルのカメラクラスの定義
//***************************************************
class CTitleCamera : public CCamera
{
public:
	CTitleCamera();
	~CTitleCamera();
	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
private:
};

#endif
