//===================================================
//
// タイトルカメラ [TitleCamera.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "TitleCamera.h"

using namespace Const; // 名前空間Constを使用

//===================================================
// コンストラクタ
//===================================================
CTitleCamera::CTitleCamera()
{

}

//===================================================
// デストラクタ
//===================================================
CTitleCamera::~CTitleCamera()
{
}

//===================================================
// 初期化処理
//===================================================
HRESULT CTitleCamera::Init(void)
{
	// 初期化処理
	CCamera::Init();

	// カメラの設定
	CCamera::SetCamera(D3DXVECTOR3(-82.64f, 168.17f, 77.67f), D3DXVECTOR3(322.3f,129.9f,-55.63f), D3DXVECTOR3(1.65f, 1.89f, 0.0f));

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CTitleCamera::Uninit(void)
{
	// 終了処理
	CCamera::Uninit();
}

//===================================================
// 更新処理
//===================================================
void CTitleCamera::Update(void)
{
#ifdef _DEBUG

	//// マウスの視点移動
	//CCamera::MouseView();

#endif // _DEBUG

	// 更新処理
	CCamera::Update();
}
