//===================================================
//
// 集中エフェクト3D [ZoneEffect3D.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "ZoneEffect.h"

//===================================================
// コンストラクタ
//===================================================
CZoneEffect3D::CZoneEffect3D()
{
}

//===================================================
// デストラクタ
//===================================================
CZoneEffect3D::~CZoneEffect3D()
{
}

//===================================================
// 生成処理
//===================================================
CZoneEffect3D* CZoneEffect3D::Create(const D3DXVECTOR3 pos, const float fRadius, const D3DXCOLOR col)
{
	// エフェクトの生成
	CZoneEffect3D* pEffect = new CZoneEffect3D;

	// エフェクトの初期化に失敗したら
	if (FAILED(pEffect->SetUp(pos, fRadius, col)))
	{
		// 破棄する
		pEffect->Uninit();
		pEffect = nullptr;

		return nullptr;
	}
	
	return pEffect;
}

//===================================================
// 初期化処理
//===================================================
HRESULT CZoneEffect3D::Init(void)
{
	// 初期化処理
	if (FAILED(CEffect3D::Init()))
	{
		return E_FAIL;
	}

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CZoneEffect3D::Uninit(void)
{
	// 終了処理
	CEffect3D::Uninit();
}

//===================================================
// 更新処理
//===================================================
void CZoneEffect3D::Update(void)
{
	// 更新処理
	CEffect3D::Update();
}

//===================================================
// 描画処理
//===================================================
void CZoneEffect3D::Draw(void)
{
	// 描画処理
	CEffect3D::Draw();
}
